app/views/users/show.html.erb

      <h3>Member Since: <%= @user.created_at.strftime("%B %d, %Y") %></h3>
      <h4><%= @user.comments.count %> total comments</h4>
      <h4><%= @user.comments.where(rating: '5_stars').count %> total 5 star reviews</h4>
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 3]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 3]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = $1 AND "comments"."rating" = $2  [["user_id", 3], ["rating", "5_stars"]]

<div class="row">
  <% @user.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 3]]