app/controllers/comments_controller.rb

  def create
    @place = Place.find(params[:place_id])
    @place.comments.create(comment_params.merge(user: current_user))
---
SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "comments" ("message", "rating", "user_id", "place_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"