app/controllers/photos_controller.rb

  def create
    @place = Place.find(params[:place_id])
    @place.photos.create(photo_params.merge(user: current_user))
---
SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
INSERT INTO "photos" ("caption", "place_id", "created_at", "updated_at", "picture", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["caption", "Test"], ["place_id", 16], ["created_at", "2019-06-28 20:56:20.393828"], ["updated_at", "2019-06-28 20:56:20.393828"], ["picture", "avo.jpg"], ["user_id", 1]]