app/controllers/places_controller.rb

SELECT  "places".* FROM "places" ORDER BY name LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "places"
---
  def index
    @places = Place.order("name").paginate(page: params[:page]).per_page(5)

INSERT INTO "places" ("name", "description", "address", "created_at", "updated_at", "user_id", "latitude", "longitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    current_user.places.create(place_params)

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "places" SET "latitude" = $1, "longitude" = $2, "updated_at" = $3 WHERE "places"."id" = $4  [["latitude", 36.1268066], ["longitude", -86.7890058], ["updated_at", "2019-06-19 22:45:43.104460"], ["id", 10]]
---
  def update
    @place = Place.find(params[:id])
    if @place.user != current_user
      return render plain: 'Not Allowed', status: :forbidden
    end

    @place.update_attributes(place_params)

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "places" WHERE "places"."id" = $1  [["id", 11]]
---
  def destroy
    @place = Place.find(params[:id])
    @place.destroy