app/views/places/index.html.erb


    <% if place.user.present? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]


    <% if place.comments.present? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."place_id" = $1  [["place_id", 24]]