app/views/places/show.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."place_id" = $1  [["place_id", 16]]
---
<div class="row">
  <% @place.photos.each do |photo| %>