app/views/places/show.html.erb

  <p><%= @place.description %></p>
  <% @place.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."place_id" = $1  [["place_id", 16]]

<div class="row">
  <% @place.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."place_id" = $1  [["place_id", 16]]