app/views/places/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."place_id" = $1  [["place_id", 10]]
---
<h1>Comments</h1>
<% @place.comments.each do |comment| %>